<template>
  <app-container>
    <div class="text-section">
      <div class="service">
        <h2 class="service-title">Дизайн</h2>
        <p>
          Создадим красивые и функциональные пространства, отражающие вашу уникальность. Воплотим
          проекты с учетом трендов, новейших технологий и персональных запросов независимо от
          статуса помещения.
        </p>

        <p>
          Разработаем дизайн-проект и рабочую документацию интерьеров, уделяя внимание деталям и
          пожеланиям заказчика. Вы получите эксклюзивный проект, в котором учтены технические и
          строительные нормы, личные вкусы и образ жизни, продуман каждый нюанс. Ограничений нет. Мы
          можем оформить объект в любом стиле: от классики до модного «лофта».
        </p>

        <p>
          Хотите обновить морально устаревший облик существующего здания или создать с нуля стильный
          фасад? Разработаем дизайн-проект фасадов.
        </p>
      </div>
      <div class="service">
        <h2 class="service-title">Продвижение проекта</h2>
        <p>
          Нужно заинтересовать инвесторов? Привлечь покупателя? Не проблема! Мы предлагаем
          концептуально новый подход к продвижению проектов. Скажем «нет» скучным, статичным кадрам
          и безжизненным картинкам. Подчеркнем уникальность вашего проекта профессиональными
          анимациями, создадим необходимое настроение с помощью качественного смонтированных
          видеороликов. Для нас нет ограничений, при необходимости, даже можем создать
          краткометражный фильм со своим сценарием и живыми актерами, еще на этапе разработки. Что в
          совокупности сделает ваш проект максимально привлекательным для покупателя как можно
          раньше.
        </p>
        <p>
          И как вишенка на торте, создадим полноценный, современный сайт для продвижения проекта.
          Вся информация по вашему проекту для покупателя в один клик: видео, визуализации, рум-
          туры, панорамы 360 градусов, планировочные решения, вся необходимая инфографика, цены,
          этапы реализации, реклама других ваших объектов и отзывы, даже если их нет.
        </p>
      </div>

      <!--      <p>Ландшафтное проектирование</p>-->
      <!--      <p>Авторский надзор</p>-->
    </div>
  </app-container>
</template>

<script setup lang="ts">
//
</script>

<style scoped lang="scss">
.text-section {
  padding: 100px 0;
  display: grid;
  grid-template-columns: 1fr 1fr;
  gap: 32px;

  @media (max-width: 600px) {
    grid-template-columns: 1fr;
    gap: 64px;
  }
}

.service p {
  font-size: 18px;
  line-height: 24px;
  margin-top: 16px;
}

.service-title {
  font-size: 28px;
  line-height: 36px;
  font-weight: 700;
  margin-bottom: 24px;
}
</style>
